Test integrator/integrator/helper-tool/templates/getFilesListFromDMS

<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:sch="http://schemas.cordys.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <sch:GetDocumentList>
            <!--1 or more repetitions:-->
            <sch:GetDocumentListRequest>
                <sch:CustomerID></sch:CustomerID>
                <sch:EnterpriseNo></sch:EnterpriseNo>
                <sch:VATNo></sch:VATNo>
                <sch:ReferenceNo></sch:ReferenceNo>
                <sch:BPCode></sch:BPCode>
                <sch:PartnerCustomerNo></sch:PartnerCustomerNo>
                <sch:CaseID>${body.applicationId}</sch:CaseID>
                <sch:DocTypeNumber></sch:DocTypeNumber>
                <sch:LimitResult></sch:LimitResult>
            </sch:GetDocumentListRequest>
        </sch:GetDocumentList>
    </soapenv:Body>
</soapenv:Envelope>